Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Compare the file with the original file to check if you ended up with what you expected.
es_es: Compare el archivo con el original para ver si obtuvo lo que esperaba.

source: Vimdiff is very useful for this |08.7|.
es_es: Vimdiff es muy útil para esta tarea |08.7|.

source: Watch out for the original file to contain a more recent version (you saved the file just before the computer crashed).
es_es: Compruebe que el archivo original no contenga una versión más reciente (guardó el archivo justo antes de que el sistema diese un fallo).

source: And check that no lines are missing (something went wrong that Vim could not recover).
es_es: Compruebe también que no se ha omitido ninguna línea (algo ha ido mal y Vim no pudo recuperar).

source: If Vim produces warning messages when recovering, read them carefully.
es_es: Si Vim genera mensajes de advertencia al recuperar un archivo, lea éstos cuidadosamente.

source: This is rare though.
es_es: Aún así, es poco habitual.

source: This usually happens if you already recovered your changes, or you wrote the file after making changes.
es_es: Habitualmente, esto ocurre si ya ha recuperado los cambios, o si editó el archivo después de realizar cambios.

source: It is safe to delete the swap file now.
es_es: En este momento ya puede eliminar el archivo de intercambio.

source: It is normal that the last few changes can not be recovered.
es_es: Es normal que los últimos cambios no se puedan recuperar.

source: Vim flushes the changes to disk when you don't type for about four seconds, or after typing about two hundred characters.
es_es: Vim vuelca los cambios al disco duro cuando no teclea durante cuatro segundos, o tras escribir unos doscientos caracteres.

source: This is set with the 'updatetime' and 'updatecount' options.
es_es: Esto se puede modificar con las opciones 'updatetime' y 'updatecount'.

source: Thus when Vim didn't get a chance to save itself when the system went down, the changes after the last flush will be lost.
es_es: De esta forma, cuando Vim no tiene posibilidad de guardar cuando el sistema cae, tendrá los cambios del último volcado.

source: Vim can store the swap file in several places.
es_es: Vim puede guardar el archivo de intercambio en distintos lugares.

source: Normally it is in the same directory as the original file.
es_es: Normalmente se encuentra en el mismo directorio que el archivo original.

source: To find it, change to the directory of the file, and use: >
es_es: Para encontrarlo, cambie al directorio del archivo y escriba: >

source: Vim will list the swap files that it can find.
es_es: Vim usará una lista de archivos de intercambio que ha encontrado.

source: It will also look in other directories where the swap file for files in the current directory may be located.
es_es: También buscará en otros directorios donde los archivos de intercambio para archivos en el actual puedan encontrarse.

source: It will not find swap files in any other directories though, it doesn't search the directory tree.
es_es: No buscará archivos de intercambio en otros directorios, ni siquiera en los subdirectorios.

source: If there are several swap files that look like they may be the one you want to use, a list is given of these swap files and you are requested to enter the number of the one you want to use.
es_es: Si hay varios archivos de intercambio que parecen ser el que quiere usar, se mostrará una lista y se requerirá que introduzcas el número del que quiere seleccionar.

source: Carefully look at the dates to decide which one you want to use.
es_es: Observe con cuidado las fechas para decidir cuál quieres usar.

source: In case you don't know which one to use, just try them one by one and check the resulting files if they are what you expected.
es_es: En caso de que no sepa cuál seleccionar, pruébelos uno a uno y compruebe que los archivos resultantes son el que deseas.

source: If you know which swap file needs to be used, you can recover by giving the swap file name.
es_es: Si sabe qué archivo de intercambio quiere usar, puede realizar la intercambio dando como argumento el nombre de este archivo.

source: Vim will then finds out the name of the original file from the swap file.
es_es: Vim encontrará el nombre del archivo original del cuál éste es el archivo de intercambio.

source: This is also handy when the swap file is in another directory than expected.
es_es: Esto resulta útil cuando el archivo de intercambio está en otro directorio diferente al esperado.

source: Vim recognizes files with the pattern *.s[uvw][a-z] as swap files.
es_es: Vim reconoce los archivos con el patrón *.s[uvw][a-z] como archivos de intercambio.

source: If this still does not work, see what file names Vim reports and rename the files accordingly.
es_es: Si esto tampoco funciona, compruebe los nombres de archivo que Vim reporta y renombre los archivos acordemente.

source: Check the 'directory' option to see where Vim may have put the swap file.
es_es: Compruebe la opción 'directory' para ver dónde ha podido poner Vim el archivo de intercambio.

source: *11.3* Crashed or not?
es_es: *11.3* ¿Se ha colgado o no?

source: Vim tries to protect you from doing stupid things.
es_es: Vim intenta protegerle de cometer estupideces.

source: Suppose you innocently start editing a file, expecting the contents of the file to show up.
es_es: Suponga que inocentemente comienza la edición de un archivo, a la espera de que los contenidos se muestren.

source: Instead, Vim produces a very long message:
es_es: En su lugar, Vim produce un mensaje muy largo:

source: E325: ATTENTION ~ Found a swap file by the name ".main.c.swp" ~ owned by: mool dated: Tue May 29 21:09:28 2001 ~ file name: ~mool/vim/vim6/src/main.c ~ modified: no ~ user name: mool host name: masaka.moolenaar.net ~ process ID: 12559 (still running) ~ While opening file "main.c" ~ dated: Tue May 29 19:46:12 2001 ~ ~ (1) Another program may be editing the same file.
es_es: E325: ATENCIÓN ~ Se ha encontrado un archivo de intercambio con el nombre ".main.c.swp" ~ propiedad de: mool de fecha: Tue May 29 21:09:28 2001 ~ nombre del archivo: ~mool/vim/vim6/src/main.c ~ modificado: no ~ nombre del usuario: mool host name: masaka.moolenaar.net ~ ID del proceso: 12559 (aún en ejecución) ~ al abrir el archivo "main.c" ~ de fecha: Tue May 29 19:46:12 2001 ~ ~ (1) Puede que otro programa esté editando el mismo archivo.

source: ~ If this is the case, be careful not to end up with two ~ different instances of the same file when making changes.
es_es: ~ De ser así, tenga cuidado de no acabar con dos ~ ejemplares diferentes del mismo archivo al hacer cambios.

source: ~ Quit, or continue with caution.
es_es: ~ Salga del programa o continúe con precaución.

source: ~ ~ (2) An edit session for this file crashed.
es_es: ~ ~ (2) Falló una sesión de edición de este archivo.

source: ~ If this is the case, use ":recover" or "vim -r main.c" ~ to recover the changes (see ":help recovery").
es_es: ~ Si es así, use \":recover\" o \"vim -r main.c" ~ para recuperar los cambios (véa \":help recovery\").

source: ~ If you did this already, delete the swap file ".main.c.swp" ~ to avoid this message.
es_es: ~ Si Ud. ya ha hecho esto, borre el archivo de intercambio ".main.c.swp" ~ para evitar este mensaje.

source: You get this message, because, when starting to edit a file, Vim checks if a swap file already exists for that file.
es_es: Ha recibido este mensaje porque cuando comienza a editar un archivo, Vim comprueba que exista un archivo de intercambio para este archivo.

source: If there is one, there must be something wrong.
es_es: Si hay uno, algo debe estar pasando.

source: It may be one of these two situations.
es_es: Puede ocurrir cualquiera de estas situaciones:

source: Another edit session is active on this file.
es_es: Hay otra sesión de edición activa en este archivo.

source: Look in the message for the line with "process ID".
es_es: Busque en el mensaje la línea con «ID del proceso».

source: It might look like this:
es_es: Puede parecerse a esto:

source: The text "(still running)" indicates that the process editing this file runs on the same computer.
es_es: El texto «(still running)» indica que el proceso que edita este archivo está corriendo en el mismo ordenador.

source: When working on a non-Unix system you will not get this extra hint.
es_es: Cuando estés bajo un sistema no Unix, no obtendrá esta información extra.

source: When editing a file over a network, you may not see the hint, because the process might be running on another computer.
es_es: Cuando edite un archivo a través de red, seguramente no verá esta información, porque el proceso estará en otro ordenador.

source: In those two cases you must find out what the situation is yourself.
es_es: Tendrá que averiguarlo por su cuenta.

source: If there is another Vim editing the same file, continuing to edit will result in two versions of the same file.
es_es: Si hay otro Vim editando el mismo archivo, continuar editándolo conllevará a que tenga dos versiones del mismo archivo.

source: The one that is written last will overwrite the other one, resulting in loss of changes.
es_es: La última que guarde sobreescribirá a la otra, con la consecuente pérdida de los cambios.

source: You better quit this Vim.
es_es: Mejor salir de este Vim.

source: The swap file might be the result from a previous crash of Vim or the computer.
es_es: El archivo de intercambio puede ser el resultado de un cuelgue anterior de Vim o del ordenador.

source: Check the dates mentioned in the message.
es_es: Revise las fechas mencionadas en el mensaje.

source: If the date of the swap file is newer than the file you were editing, and this line appears:
es_es: Si la fecha del archivo de intercambio es más reciente que la del archivo que está editando, y aparece esta línea:

source: Then you very likely have a crashed edit session that is worth recovering.
es_es: Entonces es muy probable que haya ocurrido algo con la sesión.

source: If the date of the file is newer than the date of the swap file, then either it was changed after the crash (perhaps you recovered it earlier, but didn't delete the swap file?), or else the file was saved before the crash but after the last write of the swap file (then you're lucky: you don't even need that old swap file).
es_es: Si la fecha del archivo es posterior a la fecha del archivo de intercambio, es que o cambiado tras el cuelgue (quizá la recuperó antes y no eliminó el archivo de intercambio), o es que el archivo fue guardado después de la última grabación del archivo de intercambio (entonces tienes suerte: no necesita ni ese viejo archivo de intercambio).

source: Vim will warn you for this with this extra line:
es_es: Vim le advertirá de esto:

source: NEWER than swap file!
es_es: MÁS NUEVO que el archivo de intercambio!

source: will appear under the name of the swap file.
es_es: aparecerá bajo el nombre del archivo de intercambio.

source: This can be good or bad, depending on circumstances.
es_es: Esto puede ser bueno o malo dependiendo de las circunstancias.

source: It is good if a previous editing session crashed without having made any changes to the file.
es_es: Son buenas noticias si la sesión anterior se colgó sin haber hecho ningún cambio al archivo.

source: Then a directory listing of the swap file will show that it has zero bytes.
es_es: En tal caso un listado de archivos del directorio mostrará que tiene cero bytes.

source: You may delete it and proceed.
es_es: Tal vez quiera eliminarla y continuar.

source: It is slightly bad if you don't have read permission for the swap file.
es_es: No son muy buenas noticias si lo que ocurre es que no tiene permisos de lectura del archivo de intercambio.

source: You may want to view the file read-only, or quit.
es_es: Tal vez desee ver el archivo en modo sólo lectura o salir.

source: On multi-user systems, if you yourself did the last changes under a different login name, a logout followed by a login under that other name might cure the "read error".
es_es: En sistemas multiusuario, si empleó otro usuario, salir y volver a identificarte tal vez resuelva el «error de lectura».

source: Or else you might want to find out who last edited (or is editing) the file and have a talk with them.
es_es: O en su defecto quizá quiera encontrar quien lo editó por última vez (o está editándolo ahora mismo) y hablar con él.

source: It is very bad if it means there is a physical read error on the disk containing the swap file.
es_es: Son muy malas noticias si significa que hay un error de lectura a nivel físico del disco duro.

source: Fortunately, this almost never happens.
es_es: Afortunadamente, esto no ocurre casi nunca.

source: You may want to view the file read-only at first (if you can), to see the extent of the changes that were "forgotten".
es_es: Quizá quiera ver el archivo en modo sólo lectura inicialmente (si puede), para ver el alcance de los cambios que fueron «olvidados».

source: If you are the one in charge of that file, be prepared to redo your last changes.
es_es: Si eres el que está a cargo del archivo, prepárate para rehacer los últimos cambios.

source: WHAT TO DO?
es_es: ¿QUÉ HACER?

source: O Open the file readonly.
es_es: O Abrir el archivo en modo sólo lectura.

source: Use this when you just want to view the file and don't need to recover it.
es_es: Use esto cuando sólo desee ver el archivo y no necesite recuperarlo.

source: You might want to use this when you know someone else is editing the file, but you just want to look in it and not make changes.
es_es: Tal vez quiera usar esto cuando sepa que alguien está usando el archivo y usted sólo quiera echar un vistazo sin hacer cambios.

source: E Edit the file anyway.
es_es: E Editar el archivo igualmente.

source: Use this with caution!
es_es: ¡Use esto con cuidado!

source: If the file is being edited in another Vim, you might end up with two versions of the file.
es_es: Si el archivo está siendo utilizado por otro Vim, terminará con dos versiones del archivo.

source: Vim will try to warn you when this happens, but better be safe then sorry.
es_es: Vim intentará advertirte si esto va a ocurrir, pero más vale prevenir.

source: R Recover the file from the swap file.
es_es: R Recuperar el archivo del archivo de intercambio.

source: Use this if you know that the swap file contains changes that you want to recover.
es_es: Emplee esto si sabe que el archivo de intercambio contiene los cambios que desea.

source: A Abort.
es_es: A Abortar.

source: Like Quit, but also abort further commands.
es_es: Como salir (Q), pero también aborta las órdenes posteriores.

source: This is useful when loading a script that edits several files, such as a session with multiple windows.
es_es: Esto es útil cuando cargue un script que edita varios archivos, como una sesión con múltiples ventanas.

source: D Delete the swap file.
es_es: D Eliminar el archivo de intercambio.

source: Use this when you are sure you no longer need it.
es_es: Use esto cuando esté seguro de que no lo necesita.

source: For example, when it doesn't contain changes, or when the file itself is newer than the swap file.
es_es: Por ejemplo, cuando no contenga cambios o cuando el archivo en sí sea más nuevo que el archivo de intercambio.

source: On Unix this choice is only offered when the process that created the swap file does not appear to be running.
es_es: En Unix esta opción sólo se ofrece cuando el proceso que creó el archivo de intercambio no parece que estar en ejecución.

source: If you do not get the dialog (you are running a version of Vim that does not support it), you will have to do it manually.
es_es: Si no ve el diálogo (está ejecutando una versión de Vim que no lo soporta, tendrá que hacerlo a mano.

source: To recover the file, use this command: >
es_es: Para recuperar el archivo, use la siguiente orden: >

source: Vim cannot always detect that a swap file already exists for a file.
es_es: Vim no puede siempre detectar cuando ya existe un archivo de intercambio para un archivo.

source: This is the case when the other edit session puts the swap files in another directory or when the path name for the file is different when editing it on different machines.
es_es: Este es el caso cuando otras sesiones de edición ponen los archivos en otro directorio o cuando una ruta de archivo difiere en máquinas distintas.

source: Therefore, don't rely on Vim always warning you.
es_es: Por lo tanto, no confíe en que Vim siempre le vaya a alertar.

source: If you really don't want to see this message, you can add the 'A' flag to the 'shortmess' option.
es_es: Si realmente no quiere ver este mensaje, puede añadir la opción 'A' a la opción 'shortmess'.

source: But it's very unusual that you need this.
es_es: Pero es poco habitual que lo necesite.

source: |swap-file| An explanation about where the swap file will be created and what its name is.
es_es: |swap-file| Una explicación sobre dónde se creará el archivo de intercambio y cuál es su nombre.

source: |:preserve| Manually flushing the swap file to disk.
es_es: |:preserve| Volcado manual de un archivo de intercambio al disco.

source: |:swapname| See the name of the swap file for the current file.
es_es: |:swapname| Ver el nombre del archivo de intercambio para el actual.

source: 'updatecount' Number of key strokes after which the swap file is flushed to disk.
es_es: 'updatecount' Número de pulsación tras las cuales el archivo de intercambio es volcado al disco.

source: 'updatetime' Timeout after which the swap file is flushed to disk.
es_es: 'updatetime' Temporizador tras el cuál se producirá el volcado a disco.

source: 'swapsync' Whether the disk is synced when the swap file is flushed.
es_es: 'swapsync' Si se debe sincornizar el disco duro tras el volcado.

source: 'directory' List of directory names where to store the swap file.
es_es: 'directory' Listado de directorios para el archivo de intercambio.

source: 'maxmem' Limit for memory usage before writing text to the swap file.
es_es: 'maxmem' Limitar el uso de memoria antes de hacer el volcado.

source: 'maxmemtot' Same, but for all files in total.
es_es: 'maxmemtot' Lo mismo pero incluyendo todos los archivos en total.

source: *usr_22.txt* For Vim version 7.3.
es_es: *usr_22.esx* Para Vim version 7.3.

source: Last change: 2010 Feb 21
es_es: Último cambio: 21/2/2010

source: Vim has a plugin that makes it possible to edit a directory.
es_es: Vim tiene una extensión que permita editar un directorio.

source: Try this: >
es_es: Pruebe esto: >

source: Through the magic of autocommands and Vim scripts, the window will be filled with the contents of the directory.
es_es: Mediante la magia de las autoórdenes y de scripts de Vim, la pantalla mostrará los contenidos del directorio.

source: The name of the browsing tool and its version number 2.
es_es: El nombre de la herramienta de exploración y su número de versión 2.

source: The name of the browsing directory 3.
es_es: El nombre del directorio presente 3.

source: The method of sorting (may be by name, time, or size) 4.
es_es: La directriz de ordenación (puede ser por nombre, tiempo o tamaño) 4.

source: How names are to be sorted (directories first, then *.h files, *.c files, etc) 5.
es_es: El orden de aparición de los nombres (primero directorios, después archivos *.h, archivos *.c, etc) 5.

source: How to get help (use the <F1> key), and an abbreviated listing of available commands 6.
es_es: Cómo obtener ayuda (use la tecla <F1>), y una lista abreviada de las órdenes disponibles 6.

source: A listing of files, including "../", which allows one to list the parent directory.
es_es: Una lista de archivos, incluyendo «../», que permite acceder al al directorio padre.

source: You can use Normal mode Vim commands to move around in the text.
es_es: Puede usar las órdenes de Vim en el modo normal para desplazarse a a través del texto.

source: For example, move the cursor atop a file and press <Enter>; you will then be editing that file.
es_es: Por ejemplo, mueva el cursor al inicio del archivo y pulse <Intro>; estará ahora editando ese archivo.

source: To go back to the browser use ":edit ." again, or use ":Explore".
es_es: Para volver al explorador, use «:edit» otra vez, o use «:Explore».

source: CTRL-O also works.
es_es: CTRL-O también funciona.

source: Try using <Enter> while the cursor is atop a directory name.
es_es: Use <Intro> mientras el cursor está sobre un nombre de directorio.

source: The result is that the file browser moves into that directory and displays the items found there.
es_es: El el resultado es que el explorador de archivos entra en ese directorio y muestra los elementos que ahí se encuentran.

source: Pressing <Enter> on the first directory "../" moves you one level higher.
es_es: Si pulsa <Intro> en el primer directorio «../», se desplazará al nivel superior.

source: Pressing "-" does the same thing, without the need to move to the "../" item first.
es_es: Pulsar «-» realiza la misma acción, sin la necesidad de posicionarse primero sobre el elemento «../».

source: You can press <F1> to get help on the things you can do in the netrw file browser.
es_es: Puede obtener ayuda pulsando <F1> referente a las acciones que puede realizar en el explorador de archivos netrw.

source: This is what you get: >
es_es: A continuación verá lo que obtiene.

source: The <F1> key thus brings you to a netrw directory browsing contents help page.
es_es: La tecla <F1> le lleva un directorio netrw explorando los contenidos de la página de ayuda.

source: It's a regular help page; use the usual |CTRL-]| to jump to tagged help items and |CTRL-O| to jump back.
es_es: Ésta es una página de ayuda normal; use |CTRL-]| para saltar entre los elementos de ayuda etiquetados, y |CTRL-O| para volver atrás.

source: <enter> Open the file in the current window.
es_es: <enter> Abrir el archivo en la ventana actual.

source: |netrw-cr| o Horizontally split window and display file |netrw-o| v Vertically split window and display file |netrw-v| p Use the |preview-window| |netrw-p| P Edit in the previous window |netrw-P| t Open file in a new tab |netrw-t|
es_es: |netrw-cr| o Dividir la ventana horizontalmente y mostrar el archivo |netrw-o| v Dividir la ventana verticalmente y mostrar el archivo |netrw-v| p Usar la |preview-window| (ventana de previsualización) |netrw-p| P Editar en la ventana anterior |netrw-P| t Abrir el archivo en una nueva pestaña |netrw-t|

source: i Controls listing style (thin, long, wide, and tree).
es_es: i Control el formato de la lista (estrecho, largo, ancho, y árbol).

source: The long listing includes size and date information.
es_es: El formato de lista largo incluye información de tamaño y fecha.

source: s Repeatedly pressing s will change the way the files are sorted; one may sort on name, modification time, or size.
es_es: s Pulsar «s» repetidas veces modifica la manera en que se organizan los archivos; una para ordenar por nombre, fecha de modificación, o tamaño.

source: r Reverse the sorting order.
es_es: r Invertir el orden de presentación.

source: c Change Vim's notion of the current directory to be the same as the browser directory.
es_es: c Cambiar la noción de directorio actual de Vim, para coincidir con el directorio del navegador.

source: (see |g:netrw_keepdir| to control this, too) R Rename the file or directory under the cursor; a prompt will be issued for the new name.
es_es: (Véase |g:netrw_keepdir| para controlare esto también.) R Renombrar el archivo o directorio bajo el cursor; verá una ventana de dialogo para introducir el nombre nuevo.
